# consts
token = '1981840763:AAFZr6Dk58S_rpHLEX6wjxcqFA12Ys0rUmA'
registration_status = None
not_working_commands = ['review', 'edit_account']

# texts
about_text = 'Этот бот предназначен для поиска соулмейта на метро. Работает только для вышкинцев (по крайней мере ' \
             'пока). '
help_text = ''
acc_create_conf_text = 'Ваш аккаунт успешно зарегистрирован. Чтобы посмотреть информацию вашего профиля, ' \
                       'воспользуйтесь функцией {0}'.format('/view_acc')
acc_del_conf_text = 'Ваш аккаунт успешно удален. Если захотите еще раз воспользоваться ботом, ' \
                    'не забудьте зарегистрироваться снова, запустив команду {0}'.format('/register')
acc_exists_text = 'Вы уже создавали профиль. Чтобы посмотреть информацию, ' \
                  'воспользуйтесь командой {0}'.format('/view_acc')
no_func_text = 'К сожалению, эта функция еще только разрабатывается :('

mdep_ask_text = 'Метро отправления?'
way_ask_text = 'На какой ветке эта станция?'
marr_ask_text = 'Метро прибытия?'

no_station_error = 'Ошибка регистрации: станции с таким названием нет в базе данных.\n\nНачните регистрацию заново.'
